In [3]:
import pandas as pd
import numpy as np

# To store one dimensional data using pandas

#### Series

In [4]:
list1 = ["A", "B", "C","D"]

In [5]:
series1 = pd.Series(list1)

In [6]:
series1

0    A
1    B
2    C
3    D
dtype: object

In [7]:
array = np.random.randint(20, 25, size=(10))

In [8]:
array

array([22, 21, 23, 21, 23, 20, 22, 23, 22, 22], dtype=int32)

In [9]:
series2 = pd.Series(array)

In [10]:
series2

0    22
1    21
2    23
3    21
4    23
5    20
6    22
7    23
8    22
9    22
dtype: int32

In [11]:
series3 = pd.Series(np.random.randint(30, 35, size=(10)))

In [12]:
series3

0    31
1    31
2    31
3    33
4    30
5    32
6    34
7    33
8    33
9    34
dtype: int32

In [13]:
print(series2 + series3)

0    53
1    52
2    54
3    54
4    53
5    52
6    56
7    56
8    55
9    56
dtype: int32

### Dataframe

In [14]:
students = ["Student1", "Student2", "Student3", "Student4", "Student5"]
rollno = ['001', '002', '003', '004', '005']
scores = [45, 56, 54, 67, 87]

In [15]:
record = {
    "Students": students,
    "Roll No": rollno,
    "Scores": scores
}

In [16]:
record

{'Students': ['Student1', 'Student2', 'Student3', 'Student4', 'Student5'],
 'Roll No': ['001', '002', '003', '004', '005'],
 'Scores': [45, 56, 54, 67, 87]}

In [17]:
record_df = pd.DataFrame(record)

In [18]:
record_df

   Students Roll No  Scores
0  Student1     001      45
1  Student2     002      56
2  Student3     003      54
3  Student4     004      67
4  Student5     005      87

In [19]:
record_df.set_index(["Roll No"])

         Students  Scores
Roll No
001      Student1      45
002      Student2      56
003      Student3      54
004      Student4      67
005      Student5      87

In [20]:
dict1 = {
    "A": [12, 13, 45, 51, 45],
    "B": [24, 26, 64, 65, 54],
    "C": [36, 54, 47, 64, 57],
    "D": [48, 87, 54, 56, 85],
    "E": [60, 17, 47, 41, 95],
    "F": [72, 16, 41, 54, 54]
}

In [21]:
df_1 = pd.DataFrame(dict1)

In [22]:
df_1

    A   B   C   D   E   F
0  12  24  36  48  60  72
1  13  26  54  87  17  16
2  45  64  47  54  47  41
3  51  65  64  56  41  54
4  45  54  57  85  95  54

## To see the columns in the df_1

In [23]:
df_1.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

### Accessing the desired columns in df_1

In [24]:
df_1["A"]

0    12
1    13
2    45
3    51
4    45
Name: A, dtype: int64

In [25]:
df_1[["A", "B"]]

    A   B
0  12  24
1  13  26
2  45  64
3  51  65
4  45  54

In [26]:
df_1["G"] = df_1["A"] + df_1["B"] + df_1["C"] + df_1["D"] + df_1["E"] + df_1["F"]

In [27]:
df_1

    A   B   C   D   E   F    G
0  12  24  36  48  60  72  252
1  13  26  54  87  17  16  213
2  45  64  47  54  47  41  298
3  51  65  64  56  41  54  331
4  45  54  57  85  95  54  390

In [28]:
df_1["H"] = df_1["G"]/6

In [29]:
df_1

    A   B   C   D   E   F    G          H
0  12  24  36  48  60  72  252  42.000000
1  13  26  54  87  17  16  213  35.500000
2  45  64  47  54  47  41  298  49.666667
3  51  65  64  56  41  54  331  55.166667
4  45  54  57  85  95  54  390  65.000000

## info() method

In [30]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
 3   D       5 non-null      int64
 4   E       5 non-null      int64
 5   F       5 non-null      int64
 6   G       5 non-null      int64
 7   H       5 non-null      float64
dtypes: float64(1), int64(7)
memory usage: 452.0 bytes

In [34]:
dict2 = {
    "Students": ["student1", "student2", "student3", "student1", "student5", "student6", "student7"],

    "Roll No": ['001', '002', np.nan, '001', '005', '006', '007'],

    "Gender": ["Male", "Female", "Male", "Male", "Female", "Male", np.nan],
    
    "Obtained mark": [45, 78, 3749, 45, 77, 87, np.nan] 
}

In [35]:
dict2

{'Students': ['student1',
  'student2',
  'student3',
  'student1',
  'student5',
  'student6',
  'student7'],
 'Roll No': ['001', '002', nan, '001', '005', '006', '007'],
 'Gender': ['Male', 'Female', 'Male', 'Male', 'Female', 'Male', nan],
 'Obtained mark': [45, 78, 3749, 45, 77, 87, nan]}

In [36]:
student_df = pd.DataFrame(dict2)
student_df

   Students Roll No  Gender  Obtained mark
0  student1     001    Male           45.0
1  student2     002  Female           78.0
2  student3     NaN    Male         3749.0
3  student1     001    Male           45.0
4  student5     005  Female           77.0
5  student6     006    Male           87.0
6  student7     007     NaN            NaN

### To check the null value

In [38]:
student_df.isnull().sum()

Students         0
Roll No          1
Gender           1
Obtained mark    1
dtype: int64

### To check the dublicate value in the record

In [ ]:
student_df.duplicated().sum()

np.int64(1)

### Remove the duplicates value

In [49]:
student_df = student_df.drop_duplicates()
student_df

   Students Roll No  Gender  Obtained mark
0  student1     001    Male           45.0
1  student2     002  Female           78.0
2  student3     NaN    Male         3749.0
4  student5     005  Female           77.0
5  student6     006    Male           87.0
6  student7     007     NaN            NaN

In [50]:
student_df.dropna()

   Students Roll No  Gender  Obtained mark
0  student1     001    Male           45.0
1  student2     002  Female           78.0
4  student5     005  Female           77.0
5  student6     006    Male           87.0